{
    "class_name": "Model", 
    "config": 
    {
        "name": "model", 
        "layers": 
        [
            {
                "name": "image_input", "class_name": "InputLayer", 
                "config": 
                {
                    "batch_input_shape": [null, 32, null, 3], 
                    "dtype": "float32", "sparse": false, "ragged": false, "name": "image_input"
                }, 
                "inbound_nodes": []
            }, 
            {
                "name": "conv1_conv", "class_name": "Conv2D", 
                "config": 
                {
                    "name": "conv1_conv", "trainable": true, "dtype": "float32", 
                    "filters": 32, 
                    "kernel_size": [3, 3], 
                    "strides": [1, 1], 
                    "padding": "same", "data_format": "channels_last", 
                    "dilation_rate": [1, 1], 
                    "activation": "linear", "use_bias": false, 
                    "kernel_initializer": 
                    {
                        "class_name": "GlorotUniform", 
                        "config": 
                        {
                            "seed": null, "dtype": "float32"
                        }
                    }, 
                    "bias_initializer": 
                    {
                        "class_name": "Zeros", 
                        "config": 
                        {
                            "dtype": "float32"
                        }
                    }, 
                    "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null
                }, 
                "inbound_nodes": [[["image_input", 0, 0, {}]]]
            }, 
            {
                "name": "conv1_bn", "class_name": "BatchNormalization", 
                "config": 
                {
                    "name": "conv1_bn", "trainable": true, "dtype": "float32", 
                    "axis": [3], 
                    "momentum": 0.99, "epsilon": 0.001, "center": true, 
                    "scale": false, 
                    "beta_initializer": 
                    {
                        "class_name": "Zeros", 
                        "config": {"dtype": "float32"}}, 
                        "gamma_initializer": 
                        {
                            "class_name": "Ones", 
                            "config": 
                            {
                                "dtype": "float32"
                            }
                        }, 
                        "moving_mean_initializer": 
                        {
                            "class_name": "Zeros", 
                            "config": 
                            {
                                "dtype": "float32"
                            }
                        }, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1_conv", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Activation", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "conv2_conv", "class_name": "Conv2D", "config": {"name": "conv2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv2_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_conv", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Activation", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_bn", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv3_conv", "class_name": "Conv2D", "config": {"name": "conv3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "conv3_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_conv", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Activation", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_bn", 0, 0, {}]]]}, {"name": "conv4_conv", "class_name": "Conv2D", "config": {"name": "conv4_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "conv4_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_conv", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Activation", "config": {"name": "conv4", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_bn", 0, 0, {}]]]}, {"name": "pool2", "class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "conv5_conv", "class_name": "Conv2D", "config": {"name": "conv5_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "conv5_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_conv", 0, 0, {}]]]}, {"name": "conv5", "class_name": "Activation", "config": {"name": "conv5", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv5_bn", 0, 0, {}]]]}, {"name": "conv6_conv", "class_name": "Conv2D", "config": {"name": "conv6_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5", 0, 0, {}]]]}, {"name": "conv6_bn", "class_name": "BatchNormalization", "config": {"name": "conv6_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv6_conv", 0, 0, {}]]]}, {"name": "conv6", "class_name": "Activation", "config": {"name": "conv6", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv6_bn", 0, 0, {}]]]}, {"name": "pool3", "class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv6", 0, 0, {}]]]}, {"name": "conv7_conv", "class_name": "Conv2D", "config": {"name": "conv7_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "conv7_bn", "class_name": "BatchNormalization", "config": {"name": "conv7_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv7_conv", 0, 0, {}]]]}, {"name": "conv7", "class_name": "Activation", "config": {"name": "conv7", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv7_bn", 0, 0, {}]]]}, {"name": "conv8_conv", "class_name": "Conv2D", "config": {"name": "conv8_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv7", 0, 0, {}]]]}, {"name": "conv8_bn", "class_name": "BatchNormalization", "config": {"name": "conv8_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv8_conv", 0, 0, {}]]]}, {"name": "conv8", "class_name": "Activation", "config": {"name": "conv8", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv8_bn", 0, 0, {}]]]}, {"name": "zero_padding2d", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv8", 0, 0, {}]]]}, {"name": "pool4", "class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"name": "conv9_conv", "class_name": "Conv2D", "config": {"name": "conv9_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool4", 0, 0, {}]]]}, {"name": "conv9_bn", "class_name": "BatchNormalization", "config": {"name": "conv9_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv9_conv", 0, 0, {}]]]}, {"name": "conv9", "class_name": "Activation", "config": {"name": "conv9", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv9_bn", 0, 0, {}]]]}, {"name": "permute", "class_name": "Permute", "config": {"name": "permute", "trainable": true, "dtype": "float32", "dims": [2, 1, 3]}, "inbound_nodes": [[["conv9", 0, 0, {}]]]}, {"name": "timedistrib", "class_name": "TimeDistributed", "config": {"name": "timedistrib", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": null, "data_format": "channels_last"}}}, "inbound_nodes": [[["permute", 0, 0, {}]]]}, {"name": "blstm1", "class_name": "Bidirectional", "config": {"name": "blstm1", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["timedistrib", 0, 0, {}]]]}, {"name": "blstm1_out", "class_name": "Dense", "config": {"name": "blstm1_out", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["blstm1", 0, 0, {}]]]}, {"name": "blstm2", "class_name": "Bidirectional", "config": {"name": "blstm2", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["blstm1_out", 0, 0, {}]]]}, {"name": "blstm2_out", "class_name": "Dense", "config": {"name": "blstm2_out", "trainable": true, "dtype": "float32", "units": 245, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["blstm2", 0, 0, {}]]]}], "input_layers": [["image_input", 0, 0]], "output_layers": [["blstm2_out", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}